///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

Функция ИспользуютсяПользователиБСП() Экспорт 
	
	Возврат тз_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Пользователи")
		И тз_ОбщегоНазначения.ОбщийМодуль("Пользователи") <> Неопределено
		И тз_ОбщегоНазначенияТрекер.ПолучитьТипОпределяемогоТипа("тз_Пользователи") <> Тип("СправочникСсылка.тз_Пользователи");
	
	КонецФункции

#КонецОбласти