///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Профиль", Объект.Профиль);
	
	ПрофильПриИзмененииНаСервере();
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       Объект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       Объект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрофильПриИзмененииНаСервере();
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначенияАналитик,           "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Комментарии,                "Задание",       ТекущийОбъект.Ссылка);
	тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗаданиеПрисоединенныеФайлы, "ВладелецФайла", ТекущийОбъект.Ссылка);
		
КонецПроцедуры

&НаСервере
Процедура ПрофильПриИзмененииНаСервере()
	
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьСостоянийЗаданий(Объект.Профиль, Элементы.Состояние.СписокВыбора);
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьВидовЗаданий(Объект.Профиль, Элементы.ВидЗадания.СписокВыбора);
	Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьПриоритетов(Объект.Профиль, Элементы.Приоритет.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	ПрофильПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы 

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции
#КонецОбласти     

