
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПрофильЗаданий", ПрофильЗаданий) И ЗначениеЗаполнено(ПрофильЗаданий) Тогда
		
		ПолученВесьСправочник = Ложь;
		МассивДоступныхВидовЗаданий = Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьВидовЗаданий(ПрофильЗаданий,, ПолученВесьСправочник);
		Если ПолученВесьСправочник Тогда
			Возврат;
		КонецЕсли;
		
		тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",
			МассивДоступныхВидовЗаданий, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	КонецЕсли;
	
	
КонецПроцедуры
