///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПрофильЗаданий", ПрофильЗаданий) И ЗначениеЗаполнено(ПрофильЗаданий) Тогда
		
		ПолученВесьСправочник = Ложь;
		МассивДоступныхВидовЗаданий = Справочники.тз_ПрофилиЗаданий.ПолучитьПереченьВидовЗаданий(ПрофильЗаданий,, ПолученВесьСправочник);
		Если ПолученВесьСправочник Тогда
			Возврат;
		КонецЕсли;
		
		тз_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"Ссылка",
			МассивДоступныхВидовЗаданий, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	КонецЕсли;
	
	
КонецПроцедуры
