///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПривестиТипЗначениеКТипуАналитики(Строка)
	
	СтрокаАналитики = Объект.ДоступныеВидыАналитик.НайтиПоИдентификатору(Строка);
	ТипЗначенияАналитики = СтрокаАналитики.Аналитика.ТипЗначения;
	Элементы.ДоступныеВидыАналитикиЗначениеПоУмолчанию.ОграничениеТипа = ТипЗначенияАналитики;
	тз_ОбщегоНазначенияВызовСервераТрекер.ЗаписатьОперациюБизнесСтатистики("ОткрытиеФормыПрофиляЗаданий");
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеВидыАналитикиАналитикаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДоступныеВидыАналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Аналитика) Тогда
		Возврат;
	КонецЕсли;
	ПривестиТипЗначениеКТипуАналитики(Элементы.ДоступныеВидыАналитики.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеВидыАналитикиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ДоступныеВидыАналитики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Аналитика) Тогда
		Возврат;
	КонецЕсли;
	ПривестиТипЗначениеКТипуАналитики(Элементы.ДоступныеВидыАналитики.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТаблицаДляПроверкиДублей = Объект.ДоступныеВидыАналитик.Выгрузить(,"Аналитика");
	ТаблицаДляПроверкиДублей.Свернуть("Аналитика");
	Если Объект.ДоступныеВидыАналитик.Количество() <> ТаблицаДляПроверкиДублей.Количество() Тогда
		ТекстСообщения = НСтр("ru='В таблице аналитик найдены дубли. Удалите дубли для записи профиля.'");
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
КонецПроцедуры
