///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура ВыполнитьПервоначальноеЗаполнение(Отказ = Ложь) Экспорт
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Новое.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Новое");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.ВРаботе.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.ВРаботе");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Завершено.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Завершено");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры