
Процедура ВыполнитьПервоначальноеЗаполнение(Отказ = Ложь) Экспорт
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Новое.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Новое");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.ВРаботе.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.ВРаботе");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Завершено.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Завершено");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры