
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиИзКонстант();
	ЗаполнитьСпискиВыбораЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементов()
	
	// Заполним список выбора тз_РеквизитЭтапаДляСвязиСПроектом
	МассивРеквизитовПоТипуПроекта = тз_ОбщегоНазначенияТрекер.ПолучитьМассивТиповСвязейЭтапаСПроектом();
	Для Каждого Реквизит Из МассивРеквизитовПоТипуПроекта Цикл
		Элементы.тз_РеквизитЭтапаДляСвязиСПроектом.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	ПриИзмененииКонстантыНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонстантыНаСервере(ИмяКонстанты)
	Константы[ИмяКонстанты].Установить(ЭтотОбъект[ИмяКонстанты]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениямиИзКонстант()
	тз_РеквизитЭтапаДляСвязиСПроектом = Константы.тз_РеквизитЭтапаДляСвязиСПроектом.Получить();
	тз_ВремяЗаписиКомментария         = Константы.тз_ВремяЗаписиКомментария.Получить();
КонецПроцедуры