///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиИзКонстант();
	ЗаполнитьСпискиВыбораЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораЭлементов()
	
	// Заполним список выбора тз_РеквизитЭтапаДляСвязиСПроектом
	МассивРеквизитовПоТипуПроекта = тз_ОбщегоНазначенияТрекер.ПолучитьМассивТиповСвязейЭтапаСПроектом();
	Для Каждого Реквизит Из МассивРеквизитовПоТипуПроекта Цикл
		Элементы.тз_РеквизитЭтапаДляСвязиСПроектом.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонстанты(Элемент)
	ПриИзмененииКонстантыНаСервере(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонстантыНаСервере(ИмяКонстанты)
	Константы[ИмяКонстанты].Установить(ЭтотОбъект[ИмяКонстанты]);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениямиИзКонстант()
	тз_РеквизитЭтапаДляСвязиСПроектом = Константы.тз_РеквизитЭтапаДляСвязиСПроектом.Получить();
	тз_ВремяЗаписиКомментария         = Константы.тз_ВремяЗаписиКомментария.Получить();
КонецПроцедуры