#Область ПрограммныйИнтерфейс

Функция ДобавитьФайлНаСервере(ПараметрыФайла, Адрес) Экспорт
	Возврат тз_РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, Адрес);
КонецФункции

Функция УдалитьФайлНаСервере(Файл) Экспорт
	Возврат тз_РаботаСФайлами.УдалитьФайл(Файл);
КонецФункции

Функция ПолучитьФайлИзХранилищаФайловНаСервере(ПрисоединенныйФайл) Экспорт
	Возврат тз_РаботаСФайлами.ПолучитьФайлИзХранилищаФайлов(ПрисоединенныйФайл);
КонецФункции

Функция ПолучитьДанныеФайла(ПрисоединенныйФайл) Экспорт
	Возврат тз_РаботаСФайлами.ПолучитьДанныеФайла(ПрисоединенныйФайл);
КонецФункции

#КонецОбласти