///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокАналитикЗадания(СписокАналитик, Задание = Неопределено, ПрофильЗаданий = Неопределено, ВызовИзЗадания = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Задание) Тогда
		// Получаем список аналитик из проекта задания и последнии значения этих аналитик.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	тз_ПрофилиЗаданий.Ссылка КАК ПараметрыПроекта
			|ПОМЕСТИТЬ втПараметрыПроектаЗадания
			|ИЗ
			|	Справочник.тз_ПрофилиЗаданий КАК тз_ПрофилиЗаданий
			|ГДЕ
			|	тз_ПрофилиЗаданий.Ссылка = &ПрофильЗаданий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	тз_ПроектыДоступныеВидыАналитик.Аналитика КАК Аналитика,
			|	тз_ПроектыДоступныеВидыАналитик.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
			|	тз_ПроектыДоступныеВидыАналитик.Обязательная КАК Обязательная,
			|	тз_ВидыАналитик.ТипЗначения КАК ТипЗначения,
			|	тз_ПроектыДоступныеВидыАналитик.НомерСтроки КАК Порядок
			|ПОМЕСТИТЬ втСписокАналитик
			|ИЗ
			|	втПараметрыПроектаЗадания КАК втПараметрыПроектаЗадания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тз_ПрофилиЗаданий.ДоступныеВидыАналитик КАК тз_ПроектыДоступныеВидыАналитик
			|			ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.тз_ВидыАналитик КАК тз_ВидыАналитик
			|			ПО тз_ПроектыДоступныеВидыАналитик.Аналитика = тз_ВидыАналитик.Ссылка
			|		ПО втПараметрыПроектаЗадания.ПараметрыПроекта = тз_ПроектыДоступныеВидыАналитик.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	тз_ЗначенияАналитикСрезПоследних.Аналитика КАК Аналитика,
			|	тз_ЗначенияАналитикСрезПоследних.Значение КАК Значение
			|ПОМЕСТИТЬ втЗначениеАналитик
			|ИЗ
			|	РегистрСведений.тз_ЗначенияАналитик.СрезПоследних(&Период, Задание = &Задание) КАК тз_ЗначенияАналитикСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСписокАналитик.Аналитика КАК Аналитика,
			|	втСписокАналитик.Аналитика.Представление КАК ИмяАналитики,
			|	втСписокАналитик.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
			|	втСписокАналитик.Обязательная КАК Обязательная,
			|	втЗначениеАналитик.Значение КАК Значение,
			|	втСписокАналитик.ТипЗначения КАК ТипЗначения,
			|	втСписокАналитик.Порядок КАК Порядок
			|ИЗ
			|	втСписокАналитик КАК втСписокАналитик
			|		ЛЕВОЕ СОЕДИНЕНИЕ втЗначениеАналитик КАК втЗначениеАналитик
			|		ПО втСписокАналитик.Аналитика = втЗначениеАналитик.Аналитика
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок";
		
		Запрос.УстановитьПараметр("Задание", Задание);
		Запрос.УстановитьПараметр("ПрофильЗаданий", ПрофильЗаданий);
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	тз_ПроектыДоступныеВидыАналитик.Аналитика КАК Аналитика,
			|	тз_ПроектыДоступныеВидыАналитик.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
			|	тз_ПроектыДоступныеВидыАналитик.Обязательная КАК Обязательная,
			|	тз_ПроектыДоступныеВидыАналитик.Аналитика.Представление КАК ИмяАналитики,
			|	тз_ВидыАналитик.ТипЗначения КАК ТипЗначения,
			|	тз_ПроектыДоступныеВидыАналитик.НомерСтроки КАК Порядок
			|ИЗ
			|	Справочник.тз_ПрофилиЗаданий.ДоступныеВидыАналитик КАК тз_ПроектыДоступныеВидыАналитик
			|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.тз_ВидыАналитик КАК тз_ВидыАналитик
			|		ПО тз_ПроектыДоступныеВидыАналитик.Аналитика = тз_ВидыАналитик.Ссылка
			|ГДЕ
			|	тз_ПроектыДоступныеВидыАналитик.Ссылка = &ПрофильЗаданий
			|	И ВЫБОР
			|			КОГДА &ВызовИзЗадания
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ тз_ПроектыДоступныеВидыАналитик.ВСписке = ИСТИНА
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Порядок";
		
		Запрос.УстановитьПараметр("ПрофильЗаданий", ПрофильЗаданий);
		Запрос.УстановитьПараметр("ВызовИзЗадания", ВызовИзЗадания);
	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СписокАналитик.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьРеквизитыИЭлементыАналитик(Форма, СписокАналитик, РодительскийЭлемент, ЗаполнитьЗначения = Ложь, ПоложениеЗаголовка = Неопределено, ВызовИзЗадания = Ложь) Экспорт
	
	// Создаем реквизиты для аналитик
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого Аналитика Из СписокАналитик Цикл
		
		Если Аналитика.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Аналитика.ЗначениеПоУмолчанию));
		
		// Создаем уникальное имя для аналитики, чтобы избежать конфликта уникальности имен
		ИмяАналиткиПриведенное = Аналитика.ИмяАналитики;
		тз_ОбщегоНазначенияКлиентСерверТрекер.УдалитьНедопустимыеСимволы(ИмяАналиткиПриведенное);
		ИмяАналиткиПриведенное = СтрЗаменить(ИмяАналиткиПриведенное, " ", "");
		
		ИмяЭлемента = ИмяАналиткиПриведенное
			+ "_"
			+ СтрЗаменить(Новый УникальныйИдентификатор, "-", "_");
			
		Аналитика.ИмяАналиткиПриведенное = ИмяАналиткиПриведенное;
		Аналитика.ИмяЭлемента = ИмяЭлемента;
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяЭлемента, Аналитика.ТипЗначения);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	// Создаем элементы для аналитик и задаем значение либо из регистра, либо из значения по-умолчанию.
	Для Каждого Аналитика Из СписокАналитик Цикл
		
		Если Аналитика.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Форма.Элементы.Добавить(Аналитика.ИмяЭлемента, Тип("ПолеФормы"), РодительскийЭлемент);
		
		НовыйЭлемент.Заголовок = Аналитика.ИмяАналитики;
		НовыйЭлемент.ПутьКДанным = Аналитика.ИмяЭлемента;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииПрограммногоРеквизита");
		
		Если ПоложениеЗаголовка <> Неопределено Тогда
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовка;
		КонецЕсли;
		
		Если ВызовИзЗадания Тогда
			НовыйЭлемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		КонецЕсли;
		
		Если Аналитика.ТипЗначения = Новый ОписаниеТипов("Булево") Тогда
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ВидФлажка = ВидФлажка.Выключатель;
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Иначе
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		
		Если ЗаполнитьЗначения Тогда
			// Аналитика по заданию еще не заполнялась.
			Если Аналитика.Значение = Неопределено Тогда
				Форма[Аналитика.ИмяЭлемента] = Аналитика.ЗначениеПоУмолчанию;
			// Есть значения из регистра.
			Иначе
				Форма[Аналитика.ИмяЭлемента] = Аналитика.Значение;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НастроитьСвязьПараметраВыбораЭтапа(ЭлементЭтапа, ИмяРеквизитаПроекта, ЭлементПараметровВыбора = Неопределено) Экспорт
	
	РеквизитЭтапаИзКонстанты = Константы.тз_РеквизитЭтапаДляСвязиСПроектом.Получить();
	Если Не ЗначениеЗаполнено(РеквизитЭтапаИзКонстанты) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементПараметровВыбора <> Неопределено Тогда
		НовыйЭлементСвязи = ЭлементПараметровВыбора.Добавить();
		НовыйЭлементСвязи.Имя = "Отбор." + РеквизитЭтапаИзКонстанты;
		НовыйЭлементСвязи.Поле = Новый ПолеКомпоновкиДанных(ИмяРеквизитаПроекта);
	Иначе
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор." + РеквизитЭтапаИзКонстанты, ИмяРеквизитаПроекта);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		ЭлементЭтапа.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТипОпределяемогоТипа(ИмяОпределяемогоТипа, ВозвратСтроки = Ложь, ТекстОшибки = "") Экспорт
	
	ТипыПределеяемогоТипа = Метаданные.ОпределяемыеТипы.Найти(ИмяОпределяемогоТипа).Тип.Типы();
	Если ТипыПределеяемогоТипа.Количество() = 1 Тогда
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипыПределеяемогоТипа[0]);
		Возврат ?(ВозвратСтроки, ОбъектМетаданных.Имя, ТипыПределеяемогоТипа[0]);
	ИначеЕсли ТипыПределеяемогоТипа.Количество() = 2 Тогда
		ИндексСтандартногоОбъекта = ТипыПределеяемогоТипа.Найти(Тип("СправочникСсылка." + ИмяОпределяемогоТипа));
		Если ИндексСтандартногоОбъекта <> Неопределено Тогда
			ТипыПределеяемогоТипа.Удалить(ИндексСтандартногоОбъекта);
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипыПределеяемогоТипа[0]);
			Возврат ?(ВозвратСтроки, ОбъектМетаданных.Имя, ТипыПределеяемогоТипа[0]);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru='Для определяемого типа %1 выбрано слишком много используемых типов.'"), ИмяОпределяемогоТипа);
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		ТекстОшибки = ?(ТипыПределеяемогоТипа.Количество() = 0,
			СтрШаблон(НСтр("ru='Для определяемого типа %1 не выбран используемый тип.'"), ИмяОпределяемогоТипа),
			СтрШаблон(НСтр("ru='Для определяемого типа %1 выбрано слишком много используемых типов.'"), ИмяОпределяемогоТипа));
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОпределяемыеТипыНапоминанийЗаполнены() Экспорт
	
	ТипНапоминанияСсылка = Метаданные.ОпределяемыеТипы.Найти("ПредметНапоминания");
	ТипНапоминанияОбъект = Метаданные.ОпределяемыеТипы.Найти("ПредметНапоминанияОбъект");
	
	Если ТипНапоминанияСсылка = Неопределено Или ТипНапоминанияОбъект = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипыСсылок = ТипНапоминанияСсылка.Тип.Типы();
	ИндексТипаСсылки = ТипыСсылок.Найти(Тип("ДокументСсылка.тз_Задание"));
	
	ТипыОбъектов = ТипНапоминанияОбъект.Тип.Типы();
	ИндексТипаОбъекта = ТипыОбъектов.Найти(Тип("ДокументОбъект.тз_Задание"));
	
	Возврат ИндексТипаСсылки <> Неопределено И ИндексТипаОбъекта <> Неопределено;
	
КонецФункции

Функция ПолучитьМассивТиповСвязейЭтапаСПроектом() Экспорт
	
	МассивТиповЭтапа = Метаданные.ОпределяемыеТипы.тз_Этапы.Тип.Типы();
	Если МассивТиповЭтапа.Количество() > 1 Тогда
		ИндексСтандартногоТипаЭтапа = МассивТиповЭтапа.Найти(Тип("СправочникСсылка.тз_Этапы"));
		Если ИндексСтандартногоТипаЭтапа <> Неопределено Тогда
			МассивТиповЭтапа.Удалить(ИндексСтандартногоТипаЭтапа);
		КонецЕсли;
	КонецЕсли;
	
	Если МассивТиповЭтапа.Количество() <> 1 Тогда
		ВызватьИсключение ?(МассивТиповЭтапа.Количество() = 0, 
			НСтр("ru='Для определяемого типа тз_Этапы не выбран тип.'"),
			НСтр("ru='Для определяемого типа тз_Этапы выбрано слишеом много типов.'"));
	КонецЕсли;
		
	МассивТиповПроекта = Метаданные.ОпределяемыеТипы.тз_Проекты.Тип.Типы();
	Если МассивТиповПроекта.Количество() > 1 Тогда
		ИндексСтандартногоТипаПроекта = МассивТиповПроекта.Найти(Тип("СправочникСсылка.тз_Проекты"));
		Если ИндексСтандартногоТипаПроекта <> Неопределено Тогда
			МассивТиповПроекта.Удалить(ИндексСтандартногоТипаПроекта);
		КонецЕсли;
	КонецЕсли;
	
	Если МассивТиповПроекта.Количество() <> 1 Тогда
		ВызватьИсключение ?(МассивТиповПроекта.Количество() = 0, 
			НСтр("ru='Для определяемого типа тз_Проекты не выбран тип.'"),
			НСтр("ru='Для определяемого типа тз_Проекты выбрано слишеом много типов.'"));
	КонецЕсли;
	
	ОбъектМетаданныхЭтапа = Метаданные.НайтиПоТипу(МассивТиповЭтапа[0]);
	ПроектОписаниеТипов = МассивТиповПроекта[0];
	МассивРеквизитовПоТипуПроекта = Новый Массив;
	Для Каждого Реквизит Из ОбъектМетаданныхЭтапа.Реквизиты Цикл
		ИндексТипаПроект = Реквизит.Тип.Типы().Найти(ПроектОписаниеТипов);
		Если ИндексТипаПроект <> Неопределено Тогда
			МассивРеквизитовПоТипуПроекта.Добавить(Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбъектМетаданныхЭтапа.СтандартныеРеквизиты Цикл
		ИндексТипаПроект = Реквизит.Тип.Типы().Найти(ПроектОписаниеТипов);
		Если ИндексТипаПроект <> Неопределено Тогда
			МассивРеквизитовПоТипуПроекта.Добавить(Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивРеквизитовПоТипуПроекта;
	
КонецФункции

Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = "") Экспорт
	
	// Проверим, есть ли подсистема мониторинга
	Если Метаданные.ОбщиеМодули.Найти("ЦентрМониторинга") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:488-выкл Модуля может не быть в системе, обходим синтаксис контроль платформы
	УстановитьБезопасныйРежим(Истина);
	МодульЦентрМониторинга = Вычислить("ЦентрМониторинга");
	// АПК:488-вкл
	
	ИмяОперации = "Инструменты.ТрекерЗаданий." + ИмяОперации;
	МодульЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий);
	
КонецПроцедуры

// Возвращает содержимое ответа HTTP-сервера, полученного методом GET, в виде строки или двоичных данных
// Параметры
//  СерверПриемник - <Строка> - доменное имя сервера или полный адрес (url) запрашиваемой ссылки.
//                        Может включать протокол (http://, https://) и порт.
//  АдресСтраницы - <Строка> - опционально. Адрес страницы на сервере без протокола (http://, https://),
//                        доменного имени сервера (хоста) и порта.
//                Если не указано, адрес страницы будет извлечён из параметра СерверПриемник
//  ПараметрыСоединения - <Структура> - опционально. Структура, содержащая дополнительные параметры для HTTPСоединение.
//                Назначение ключей:
//                Логин или Пользователь - Тип Строка - Имя пользователя на указанном сервере.
//                Пароль - Тип Строка - Пароль пользователя на указанном сервере.
//                Прокси - Тип ИнтернетПрокси - Прокси, используемый для соединения с сервером.
//                Таймаут - Тип Число - Таймаут осуществляемого соединения и операций, в секундах. 0 - не устанавливать таймаут..
//  ЗаголовкиHTTP  - <Соответствие> - опционально.
//                Заголовки, которые будут отправлены на сервер в виде соответствия: "Заголовок" - "Значение".
//                Если указано, функция возвратит в программу заголовки HTTP-ответа с кодом состояния в ключе StatusCode,
//                имя файла в ключе FileName, url-кодированное имя в ключе EncodeFileName
//  ПолучитьКакДвоичныеДанные - <Булево> - опционально. Определяет, в каком виде получить содержимое ответа сервера
//                            По умолчанию Ложь.
//  ЗащищенноеСоединение - <Булево> - опционально. По умолчанию Ложь.
//                            Если Истина, соединение будет происходить по протоколу https://
//
// Возвращаемое значение:
//   <Строка>, <ДвоичныеДанные> - содержимое ответа сервера, если ресурс найден по указанному адресу.
//
Функция ПолучитьСодержимоеВебАдреса(Знач СерверПриемник, Знач АдресСтраницы = "",
	Знач ПараметрыСоединения = Неопределено, ЗаголовкиHTTP = Неопределено,
	Знач ПолучитьКакДвоичныеДанные = Истина, Знач ЗащищенноеСоединение = Ложь) Экспорт
	
	Перем ИмяФайлаОтветаКодированное, ИмяФайлаОтвета, Порт, Логин, Пользователь, Пароль, Прокси, Таймаут;
	
	Если Не ЗначениеЗаполнено(СерверПриемник) Тогда 
		Возврат Неопределено; 
	КонецЕсли;
	
	Если ТипЗнч(ЗаголовкиHTTP) <> Тип("Соответствие") Тогда
		ЗаголовкиHTTP = Новый Соответствие;
	КонецЕсли;
	
	Если Найти(Нрег(СерверПриемник), "https://") = 1 Тогда
		ЗащищенноеСоединение = Истина;
	КонецЕсли;
	
	Протокол = ?(Найти(Нрег(СерверПриемник), "https://") = 1 ИЛИ ЗащищенноеСоединение, "https://", "http://");
	
	Если Лев(НРег(СерверПриемник), СтрДлина(Протокол)) = Протокол Тогда
		СерверПриемник = Сред(СерверПриемник, СтрДлина(Протокол) + 1);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресСтраницы) Тогда
		
		Позиция = Найти(СерверПриемник, "/");
		
		Если Позиция > 0 Тогда
			АдресСтраницы = Сред(СерверПриемник, Позиция, СтрДлина(СерверПриемник));
			СерверПриемник = Лев(СерверПриемник, Позиция - 1);
		Иначе
			АдресСтраницы = "/";
		КонецЕсли;
		
	КонецЕсли;
	
	СерверПриемник = СтрЗаменить(СерверПриемник, "/", "");
	
	//Выделяем порт из доменного имени
	ПозицияДвоеточия = Найти(СерверПриемник, ":");
	
	Если ПозицияДвоеточия > 0 Тогда
		Порт = Число(Сред(СерверПриемник, ПозицияДвоеточия + 1));
		СерверПриемник = Лев(СерверПриемник, ПозицияДвоеточия - 1);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыСоединения) = Тип("Структура") Тогда
		
		Для каждого КлючЗначение из ПараметрыСоединения Цикл
			Значение = КлючЗначение.Значение; Выполнить(КлючЗначение.Ключ + " = Значение;");
		КонецЦикла;
		Пользователь = ?(ЗначениеЗаполнено(Пользователь), Пользователь, Логин);
		
	КонецЕсли;
	
	НТТР = Новый HTTPСоединение(СерверПриемник, Порт, Пользователь, Пароль, Прокси, Таймаут,
	
	?(ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено));
	
	//Ответ от сервера получим в возвращаемом значении типа HTTPОтвет
	ОтветHTTP = НТТР.Получить(Новый HTTPЗапрос(АдресСтраницы, ЗаголовкиHTTP)); //
	
	ОшибкаЗапроса = (ОтветHTTP.КодСостояния >= 400);
	
	//После получения ответа сервера необходимо проверить статус или код состояния.
	
	//301 Moved Permanently («перемещено навсегда») или 302 Moved Temporarily («перемещено временно»),
	//то в этом случае можно попытаться перейти на ресурс, на который переадресовал сервер
	Если ОтветHTTP.КодСостояния = 301 или ОтветHTTP.КодСостояния = 302 Тогда
		
		Если ОтветHTTP.Заголовки.Количество() > 0 Тогда
			
			//Адрес страницы переадресации содержится в поле Location заголовка ответа
			АдресСтраницы = ОтветHTTP.Заголовки["Location"]; //
			
			Если ЗначениеЗаполнено(АдресСтраницы) Тогда
				
				Если Найти(НРег(АдресСтраницы), "http://") = 0 И Найти(НРег(АдресСтраницы), "https://") = 0 Тогда
					
					АдресСтраницы = ?(Лев(АдресСтраницы, 1) = "/", Сред(АдресСтраницы, 2), АдресСтраницы);
					Если Найти(АдресСтраницы, СерверПриемник + "/") = 0  Тогда
						АдресСтраницы = Протокол + СерверПриемник + ?(ЗначениеЗаполнено(Порт), ":" + Порт, "") + "/" + АдресСтраницы;
					КонецЕсли;
					
				КонецЕсли;
				
				// Если сервер вернул cookies (http://ru.wikipedia.org/wiki/HTTP_cookie, http://www.faqs.org/rfcs/rfc6265.html?#41; 
				// Вставим их в заголовки для передачи на страницу перехода
				Куки = ОтветHTTP.Заголовки["Set-Cookie"];//
				
				Если ЗначениеЗаполнено(Куки) Тогда 
					ЗаголовкиHTTP.Вставить("Cookie", Куки);
				КонецЕсли;
				
				//Рекурсивный вызов
				Возврат ПолучитьСодержимоеВебАдреса(АдресСтраницы, , , ЗаголовкиHTTP, ПолучитьКакДвоичныеДанные, ЗащищенноеСоединение);//
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ОтветHTTP.КодСостояния >= 100 И ОтветHTTP.КодСостояния <= 200 Тогда
		
		//Статус ответа в интервале между 100 и 200 Ok говорит о нормальном результате HTTP-запроса
		Если ОтветHTTP.Заголовки.Количество() > 0 Тогда
			
			ТипСодержимого = ОтветHTTP.Заголовки["Content-Type"];
			
			//http://ru.wikipedia.org/wiki/Список_MIME-типов.
			Если Найти(ТипСодержимого, "text/") = 1 ИЛИ Найти(ТипСодержимого, "/javascript")
				ИЛИ Найти(ТипСодержимого, "+xml") 
				ИЛИ Найти(ТипСодержимого, "/xml") <> 0 
				ИЛИ Найти(ТипСодержимого, "/json") <> 0 Тогда
				
				ПолучитьКакДвоичныеДанные = Ложь;
				
			ИначеЕсли Найти(ТипСодержимого, "image/") = 1 ИЛИ Найти(ТипСодержимого, "video/") = 1 
				ИЛИ Найти(ТипСодержимого, "application/") = 1 ИЛИ Найти(ТипСодержимого, "audio/") = 1 Тогда
				
				//Если содержимое полученного ответа представляет собой изображение, видео, приложение,
				//возвращаем двоичные данные, так как возвращать в виде строки не имеет смысла.
				ПолучитьКакДвоичныеДанные = Истина;
				
			КонецЕсли;
			
			//Некоторые сервера возвращают в типе содержимого имя отданного файла, например image/png; name="Имя файла.png"
			//или отдают в заголовке Content-Disposition: attachment; filename=Имя файла.png (http://www.http11.ru/post.php?post=2)
			Если ОтветHTTP.Заголовки["Content-Disposition"] <> Неопределено Тогда
				ТипСодержимого = ОтветHTTP.Заголовки["Content-Disposition"];
			КонецЕсли;
			
			ТипСодержимого = СтрЗаменить(СтрЗаменить(ТипСодержимого, """", ""), "'", "");
			
			//в ключе filename*=UTF-8'' содержится url-кодированное имя файла
			ПозицияИмениФайла = Найти(ТипСодержимого, "filename*=UTF-8");
			
			Если ПозицияИмениФайла <> 0 Тогда
				
				ИмяФайлаОтветаКодированное = Сред(ТипСодержимого, ПозицияИмениФайла + СтрДлина("filename*=UTF-8"));
				
				ПозицияДвоеточия = Найти(ИмяФайлаОтветаКодированное, ";");
				
				Если ПозицияДвоеточия <> 0 Тогда
					ИмяФайлаОтветаКодированное = Лев(ИмяФайлаОтветаКодированное, ПозицияДвоеточия - 1);
				КонецЕсли;
				
			КонецЕсли;
			
			//в ключе filename= содержится обычное имя файла
			ПозицияИмениФайла = Найти(ТипСодержимого, "name=");
			
			Если ПозицияИмениФайла <> 0 Тогда
				
				ИмяФайлаОтвета = Сред(ТипСодержимого, ПозицияИмениФайла + СтрДлина("name="));
				
				ПозицияДвоеточия = Найти(ИмяФайлаОтвета, ";");
				
				Если ПозицияДвоеточия <> 0 Тогда
					ИмяФайлаОтвета = Лев(ИмяФайлаОтвета, ПозицияДвоеточия - 1);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаголовкиHTTP = ОтветHTTP.Заголовки;
	
	//Добавляем в заголовки ответа код состояния (ответа) HTTP-сервера и имя файла содержимого, если есть.
	ЗаголовкиHTTP.Вставить("StatusCode", ОтветHTTP.КодСостояния);
	
	Если ЗначениеЗаполнено(ИмяФайлаОтвета) Тогда 
		ЗаголовкиHTTP.Вставить("FileName", ИмяФайлаОтвета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяФайлаОтветаКодированное) Тогда
		ЗаголовкиHTTP.Вставить("EncodeFileName", ИмяФайлаОтветаКодированное);
	КонецЕсли;
	
	Если ОшибкаЗапроса ИЛИ НЕ ПолучитьКакДвоичныеДанные Тогда
		Возврат ОтветHTTP.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат ОтветHTTP.ПолучитьТелоКакДвоичныеДанные();
	
КонецФункции // ПолучитьСодержимоеВебАдреса()

#КонецОбласти