///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

Функция ПолучитьОпределяемыТипСтрокой(ИмяОпределяемогоТипа, ТекстОшибки = "") Экспорт
	Возврат тз_ОбщегоНазначенияТрекер.ПолучитьТипОпределяемогоТипа(ИмяОпределяемогоТипа, Истина, ТекстОшибки);
КонецФункции

Процедура НачатьПроверкуВерсииРасширения() Экспорт
	тз_ОбновлениеИнформационнойБазыТрекер.ПроверитьРасширение();
КонецПроцедуры

Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = "") Экспорт
	тз_ОбщегоНазначенияТрекер.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий);
КонецПроцедуры

#КонецОбласти