#Область ПрограммныйИнтерфейс

Функция ПолучитьОпределяемыТипСтрокой(ИмяОпределяемогоТипа, ТекстОшибки = "") Экспорт
	Возврат тз_ОбщегоНазначенияТрекер.ПолучитьТипОпределяемогоТипа(ИмяОпределяемогоТипа, Истина, ТекстОшибки);
КонецФункции

Процедура НачатьПроверкуВерсииРасширения() Экспорт
	тз_ОбновлениеИнформационнойБазыТрекер.ПроверитьРасширение();
КонецПроцедуры

Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = "") Экспорт
	тз_ОбщегоНазначенияТрекер.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий);
КонецПроцедуры

#КонецОбласти