///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&После("УстановкаПараметровСеанса")
Процедура тз_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено
		И Не тз_ПользователиВызовСервера.ИспользуютсяПользователиБСП() Тогда
		тз_Пользователи.УстановкаПараметровСеанса(ТребуемыеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти