
Функция ПолучитьДатуПоследнегоКомментарияПоЗаданию(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	тз_Комментарии.Ссылка КАК Ссылка,
		|	тз_Комментарии.ДатаСоздания КАК ДатаСоздания
		|ИЗ
		|	Справочник.тз_Комментарии КАК тз_Комментарии
		|ГДЕ
		|	тз_Комментарии.Задание = &Задание
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДатаСоздания;
	
КонецФункции